app/controllers/user_sessions_controller.rb

INSERT INTO `users` (`secret_token`, `created_at`, `last_request_at`, `updated_at`, `authorized_at`, `linkedin_name`, `admin`, `profile_xml`, `failed_login_count`, `current_login_ip`, `linked_in_id`, `current_login_at`, `last_name`, `persistence_token`, `login_count`, `last_login_ip`, `last_login_at`, `email`, `access_token`, `first_name`) VALUES('6e82ada3-c37e-455e-92df-5c3ea2f6e4a4', '2009-12-12 21:14:19', '2009-12-12 21:14:19', '2009-12-12 21:14:19', NULL, NULL, NULL, '<?xml version=\"1.0\" encoding=\"UTF-8\" standalone=\"yes\"?>\n<person>\n <id>pgTUbOOh0o</id>\n <first-name>Mark</first-name>\n <last-name>Percival</last-name>\n <industry>Internet</industry>\n <headline>Principle Engineer at SquarePush, LLC</headline>\n <summary>I have experience in a wide range of internet related technologies. I\'m looking for opportunities at small firms with exciting ideas who are seeking a technically focused implementer.</summary>\n <picture-url>http://media.linkedin.com/mpr/mpr/shrink_80_80/p/3/000/008/069/3d89df5.jpg</picture-url>\n</person>\n', 0, '127.0.0.1', 'pgTUbOOh0o', '2009-12-12 21:14:19', NULL, '1d4c75fad1b11c9e1280cca47a7228b17dd4407b927c49f7706ebfe1737043b0a3d84a50081cd0d2bd16d15f5abdc8791caef9fdac57bba82c0d63194f9e9d4d', 1, NULL, NULL, NULL, '2080815b-8e16-4a52-bcce-ccc7b6ecaabe', NULL)
---
  def create
    request_token = OAuth::RequestToken.new(LinkedIn.client, session[:request_token], session[:request_token_secret])
    access_token = request_token.get_access_token(:oauth_verifier => params["oauth_verifier"])
    user = User.initialize_with_access_token(access_token)
    if user
      UserSession.create(user, true)